1. ¿Qué diferencia hay entre una Serie y un DataFrame?

La principal diferencia recae en la dimensión de ambas estructuras. En el caso de la Serie se trata de una estructura unidimensional (lo que equivale a una columna de una tabla en Pandas), mientras que el DataFrame es bidimensional (lo que equivale a una tabla en Pandas).

In [1]:
import pandas as pd
import numpy as np

2. Momento de trabajar con Series. Contestad a las siguientes preguntas:

Crea dos listas:
    - Una que se llame "valores" que tenga 7 números aleatorios.
    - Otra que se llame "indices" que tenga 7 strings que se llamen como los días de la semana.

In [3]:
np.random.seed(7)
valores = np.random.randint(0,100,(7))
v_list = (list(valores))
v_list

indices = ['Lunes','Martes','Miércoles','Jueves','Viernes','Sábado','Domingo']

A partir de estas dos listas cread una Serie donde la variable "valores" sean los valores de la Serie y la variable indices sean los índices de la Serie.

In [4]:
serie = pd.Series(valores,index=indices)
serie

Lunes        47
Martes       68
Miércoles    25
Jueves       67
Viernes      83
Sábado       23
Domingo      92
dtype: int64

A partir de las dos listas anteriores cread un diccionario usando un bucle for. Para hacer esto tenemos el método zip que nos permite iterar por dos listas a la vez. Más informción sobre este método aquí.

In [5]:
zip_ = zip(indices, valores)

In [6]:
lista = list(zip_)
lista

[('Lunes', 47),
 ('Martes', 68),
 ('Miércoles', 25),
 ('Jueves', 67),
 ('Viernes', 83),
 ('Sábado', 23),
 ('Domingo', 92)]

In [7]:
diccionario = {}
for key,value in zip_:
    diccionario.update({key:value})
diccionario

{}

Crea una Serie con el diccionario creado en el punto anterior.

In [8]:
serie2 = pd.Series(diccionario)
serie2

/var/folders/fk/9dj5qplx5dv2l_dlsz8sf1pw0000gn/T/ipykernel_5333/186841165.py:1: DeprecationWarning: The default dtype for empty Series will be 'object' instead of 'float64' in a future version. Specify a dtype explicitly to silence this warning.
  serie2 = pd.Series(diccionario)

Series([], dtype: float64)

¿Qué forma tiene esta última Serie?

In [9]:
serie2.shape

(0,)

¿Qué tipo de datos tiene?

In [10]:
serie2.dtypes

dtype('float64')

¿Qué tamaño tiene?

In [11]:
serie2.size

0

¿Cuáles son los índices de la Serie?

In [12]:
serie2.index

Index([], dtype='object')

¿Y los values?

In [13]:
serie2.values

array([], dtype=float64)

Extraed el valor para el índice "lunes"

In [14]:
serie.loc['Lunes']

47

In [15]:
serie.iloc[0]

47

Extraed el valor para el índice "lunes", "martes" y "miércoles".

In [16]:
serie.loc[['Lunes','Martes','Miércoles']]

Lunes        47
Martes       68
Miércoles    25
dtype: int64

Extraed el valor para el índice "lunes" y "domingo".

In [17]:
serie.loc[['Lunes','Domingo']]

Lunes      47
Domingo    92
dtype: int64

3. Es el turno de los DataFrames

Cread un array de dos dimensiones con 4 filas y 3 columnas.

In [18]:
np.random.seed(5)
array2 = np.random.randint(0,100,(4,3))
array2

array([[99, 78, 61],
       [16, 73,  8],
       [62, 27, 30],
       [80,  7, 76]])

Convertid el array en un DataFrame donde las columnas se llamen "España", "Francia" e "Italia".

In [19]:
df = pd.DataFrame(array2,columns=['España','Francia','Italia'])
df

   España  Francia  Italia
0      99       78      61
1      16       73       8
2      62       27      30
3      80        7      76

Descargad el archivo "medallas" y cargad el DataFrame con la siguiente línea de código:

In [2]:
df = pd.read_csv("../DATA/medallas.csv", index_col=["País"])
df

                 Unnamed: 0   Oro  Plata  Bronce
País
China                     1  1473    994     720
Japón                     2  1032   1037     985
Corea del Sur             3   745    663     827
Irán                      4   179    181     197
Kazajistán                5   155    158     224
India                     6   154    202     315
Tailandia                 7   132    175     278
Indonesia                 8   112    131     240
China Taipéi              9    99    144     276
Corea del Norte          10    91    120     235

Usando el loc extraed todas las columnas de la fila. (ENTENDEMOS QUE QUIERE LA PRIMERA FILA, CHINA)

In [3]:

df.loc['China',:]

Unnamed: 0       1
Oro           1473
Plata          994
Bronce         720
Name: China, dtype: int64

Usando el loc extraed todas las columnas de China e Irán.

In [24]:

df.loc[("China","Irán"),:]

       Unnamed: 0   Oro  Plata  Bronce
País
China           1  1473    994     720
Irán            4   179    181     197

Usando el loc extraed solo las columnas de "Oro", "Plata" y "Bronce" de China e Irán.

In [25]:

df.loc[("China","Irán"),("Oro","Plata","Bronce")]

        Oro  Plata  Bronce
País
China  1473    994     720
Irán    179    181     197

Usando el iloc extraed la información de la India. Devolved todas las columnas.

In [26]:

df.iloc[5,:]

Unnamed: 0      6
Oro           154
Plata         202
Bronce        315
Name: India, dtype: int64

Usando el iloc extraed todas las columnas de los paises que estén en posición impar. 
La primera que nos tendría que salir es Japón y la última Corea del Norte.

In [31]:

df.iloc[1::2,:]

                 Unnamed: 0   Oro  Plata  Bronce
País
Japón                     2  1032   1037     985
Irán                      4   179    181     197
India                     6   154    202     315
Indonesia                 8   112    131     240
Corea del Norte          10    91    120     235

Utilizando el código del ejercicio anterior, seleccionad unicamente las columnas "Oro", "Plata" y "Bronce".

In [36]:

df.iloc[1::2,[1,2,3]]

                  Oro  Plata  Bronce
País
Japón            1032   1037     985
Irán              179    181     197
India             154    202     315
Indonesia         112    131     240
Corea del Norte    91    120     235

Contestad a las siguientes preguntas:
 - ¿Qué país consiguió más de 200 medallas de oro?
 - Qué país consiguió más de 200 medallas de oro y más de 1000 de plata?
 - ¿Qué país consiguió más de 200 medallas de oro o más de 700 de bronce?

In [56]:
# ¿Qué país consiguió más de 200 medallas de oro?
print('Ejercicio', 1)
print(df[df.Oro>200])
# ¿Qué país consiguió más de 200 medallas de oro y más de 1000 de plata?
print('-----------')
print('Ejercicio', 2)
print(df[(df.Oro>200)&(df.Plata>1000)])
# ¿Qué país consiguió más de 200 medallas de oro o más de 700 de bronce?
print('-----------')
print('Ejercicio', 3)
print(df[(df.Oro>200)|(df.Bronce>700)])

Ejercicio 1
               Unnamed: 0   Oro  Plata  Bronce
País
China                   1  1473    994     720
Japón                   2  1032   1037     985
Corea del Sur           3   745    663     827
-----------
Ejercicio 2
       Unnamed: 0   Oro  Plata  Bronce
País
Japón           2  1032   1037     985
-----------
Ejercicio 3
               Unnamed: 0   Oro  Plata  Bronce
País
China                   1  1473    994     720
Japón                   2  1032   1037     985
Corea del Sur           3   745    663     827

Como vemos hay una columna que se llama Unnamed: 0 que no nos interesa. Eliminad esa columna.

In [81]:

df = df.drop(['Unnamed: 0'],axis=1)

Cread una nueva columma que se llame "total" que sea el resultado de la suma de todas las medallas obtenidas por cada país.

In [82]:

df['Total medallas']=(df['Oro']+df['Plata']+df['Bronce'])
df

                  Oro  Plata  Bronce  Total medallas
País
China            1473    994     720            3187
Japón            1032   1037     985            3054
Corea del Sur     745    663     827            2235
Irán              179    181     197             557
Kazajistán        155    158     224             537
India             154    202     315             671
Tailandia         132    175     278             585
Indonesia         112    131     240             483
China Taipéi       99    144     276             519
Corea del Norte    91    120     235             446